soyunomas/esp32-projects/WiFi-Motion-RSSI-C3-AP-Scanner/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_FREERTOS_HZ=1000
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_PROBE_LIMIT_CHANNELS=y
CONFIG_PROBE_REFERENCE_CHANNEL_1=1
CONFIG_PROBE_REFERENCE_CHANNEL_2=6
CONFIG_PROBE_CALIBRATION_SCANS=40
# CONFIG_PROBE_FORCE_RECALIBRATION is not set
CONFIG_PROBE_MANUAL_SSID_1=""
CONFIG_PROBE_MANUAL_SSID_2=""
CONFIG_PROBE_SELECTOR_MINIMUM_SAMPLES=20
CONFIG_PROBE_SELECTOR_MINIMUM_PRESENCE_PERCENT=80
CONFIG_PROBE_SELECTOR_MINIMUM_RSSI_DBM=-90
CONFIG_PROBE_SELECTOR_MAXIMUM_MAD_DB=6
CONFIG_PROBE_SELECTOR_MAXIMUM_REFERENCES=8
CONFIG_PROBE_DETECTOR_MINIMUM_COVERAGE_PERCENT=60
CONFIG_PROBE_DETECTOR_NOISE_FLOOR_DB_X10=20
CONFIG_PROBE_DETECTOR_TRIGGER_SCORE_X100=250
CONFIG_PROBE_DETECTOR_RELEASE_SCORE_X100=125
CONFIG_PROBE_DETECTOR_ADAPTIVE_SIGMA_X100=400
CONFIG_PROBE_DETECTOR_ADAPTIVE_WINDOW=32
CONFIG_PROBE_DETECTOR_BASELINE_ALPHA_PERMILLE=5
CONFIG_PROBE_DETECTOR_WARMUP_SCANS=5
CONFIG_PROBE_DETECTOR_TRIGGER_CONSECUTIVE=2
CONFIG_PROBE_DETECTOR_CLEAR_CONSECUTIVE=5
CONFIG_PROBE_DETECTOR_UNHEALTHY_CONSECUTIVE=2
CONFIG_PROBE_DETECTOR_RECOVERY_CONSECUTIVE=3
CONFIG_PROBE_DETECTOR_STALE_AFTER_SCANS=3
CONFIG_PROBE_STATUS_LED_GPIO=8
CONFIG_PROBE_STATUS_LED_ACTIVE_LOW=y
CONFIG_PROBE_PORTAL_LONG_PRESS_MS=3000
CONFIG_PROBE_PORTAL_AP_SSID="Motion-C3-Setup"
CONFIG_PROBE_PORTAL_AP_PASSWORD="motion-c3-setup"
